# EndeavourOS / Arch Linux — Pacman Packages
# Generated: 2026-06-14
# Install: sudo pacman -S --needed - < packages/pacman.txt

## Base System
base
base-devel
linux
linux-firmware
linux-headers
sudo
grub
efibootmgr
os-prober
btrfs-progs
dosfstools
exfatprogs
ntfs-3g
f2fs-tools

## Networking
networkmanager
network-manager-applet
netctl
iwd
wireless-regdb
bluez
bluez-utils
blueman
firewalld
avahi
bind
nss-mdns
openssh
curl
wget
socat
ethtool
iw

## Hyprland Ecosystem
hyprland
hyprpaper
hyprlock
hypridle
hyprshot
hyprcursor
xdg-desktop-portal-hyprland
waybar
wlogout
rofi
swaync
dunst
grim
slurp
cliphist
wl-clipboard
brightnessctl

## Display / Session
sddm
seatd
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-user-dirs
xorg-xwayland

## Audio
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
wireplumber
pulseaudio-qt
pavucontrol
playerctl
helvum

## Fonts
ttf-jetbrains-mono-nerd
ttf-dejavu
ttf-liberation
ttf-bitstream-vera
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
cantarell-fonts
ttf-opensans
adwaita-fonts
ttf-hack

## CLI Tools
zsh
zsh-completions
bash-completion
bat
eza
fd
fzf
ripgrep
ripgrep-all
lazygit
tmux
stow
zoxide
fastfetch
btop
tldr
fzf
sd
duf
jq
yq
htop
neovim
tree
unzip
zip
unrar
p7zip
parallel

## Development
git
github-cli
nodejs
npm
python
python-pip
python-setuptools
python-wheel
go
rust
cargo
llvm
clang
gcc
make
cmake
meson
ninja
pkgconf
patch
autoconf
automake
m4
bison
flex
valgrind
gdb
strace
ltrace
lsof
checksec
patchelf

## GTK / Themes
gtk3
gtk4
gtk-layer-shell
gtk4-layer-shell
adwaita-icon-theme
adwaita-icon-theme-legacy
breeze
breeze-gtk
breeze-icons
kvantum
qt5ct
qt6ct
nwg-look

## Language / Input
fcitx5
fcitx5-bamboo
fcitx5-configtool
fcitx5-gtk
fcitx5-qt
ibus

## Desktop Apps
ghostty
firefox
brave-bin
thunar
nemo
dolphin
dolphin-plugins
ark
gwenview
mpv
vlc
celluloid
haruna
obs-studio
evince
loupe
spectacle
okular
kate
kcalc
konsole
kdeconnect
keepassxc
spotify
nautilus
neovim

## System Tools
reflector
reflector-simple
rate-mirrors
pacman-contrib
pkgfile
expac
alsa-utils
lm_sensors
inxi
hwdetect
dmidecode
smartmontools
hdparm
parted
gparted
udisks2

## Misc
neofetch
fastfetch
cmatrix
cbonsai
cowsay
fortune-mod
figlet
lolcat
boxes

## Firmware
intel-ucode
sof-firmware
alsa-firmware
linux-firmware
